<a href="https://colab.research.google.com/github/guidiniz/models_machinelearning_python/blob/main/modelo_titanic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

***Importando as váriaveis de ambiente***

In [2]:
import pandas as pd
import numpy as np
from sklearn.ensemble import RandomForestClassifier
from sklearn.model_selection import train_test_split

**Importando os Dados**

In [3]:
dados = pd.read_csv('/content/train.csv')

**Fazendo a leitura dos Dados**

In [4]:
dados.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

**Excluindo Colunas desnecessárias para Analise**

In [5]:
dados = dados.drop(['Name', 'Ticket', 'Cabin', 'Embarked'], axis=1)

**Mostrando os novos Dados**

In [6]:
dados.head()

   PassengerId  Survived  Pclass     Sex   Age  SibSp  Parch     Fare
0            1         0       3    male  22.0      1      0   7.2500
1            2         1       1  female  38.0      1      0  71.2833
2            3         1       3  female  26.0      0      0   7.9250
3            4         1       1  female  35.0      1      0  53.1000
4            5         0       3    male  35.0      0      0   8.0500

**Editando chave e variavél reposta**

In [7]:
dados = dados.set_index(['PassengerId'])
dados = dados.rename(columns = {'Survived':'Target'}, inplace = False)

**Fazendo a leitura dos novos dados com novo ID**

In [8]:
dados.head()

             Target  Pclass     Sex   Age  SibSp  Parch     Fare
PassengerId
1                 0       3    male  22.0      1      0   7.2500
2                 1       1  female  38.0      1      0  71.2833
3                 1       3  female  26.0      0      0   7.9250
4                 1       1  female  35.0      1      0  53.1000
5                 0       3    male  35.0      0      0   8.0500

**Descritiva**

In [9]:
dados.describe()

           Target      Pclass         Age       SibSp       Parch        Fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

**Descritiva de Sexo**

In [10]:
dados.describe(include=['O'])

         Sex
count    891
unique     2
top     male
freq     577

**Tranformação dos Dados**

In [11]:
dados['Sex_F'] = np.where(dados['Sex']=='female',1,0)

dados['Pclass_1'] = np.where(dados['Pclass']== 1 ,1,0)
dados['Pclass_2'] = np.where(dados['Pclass']== 2 ,1,0)
dados['Pclass_3'] = np.where(dados['Pclass']== 3,1,0)

In [12]:
dados = dados.drop(['Pclass','Sex'], axis =1)

In [13]:
dados.head()

             Target   Age  SibSp  Parch  ...  Sex_F  Pclass_1  Pclass_2  Pclass_3
PassengerId                              ...
1                 0  22.0      1      0  ...      0         0         0         1
2                 1  38.0      1      0  ...      1         1         0         0
3                 1  26.0      0      0  ...      1         0         0         1
4                 1  35.0      1      0  ...      1         1         0         0
5                 0  35.0      0      0  ...      0         0         0         1

[5 rows x 9 columns]

In [14]:
dados.isnull().sum()

Target        0
Age         177
SibSp         0
Parch         0
Fare          0
Sex_F         0
Pclass_1      0
Pclass_2      0
Pclass_3      0
dtype: int64

In [15]:
dados.fillna(0, inplace = True)

In [16]:
dados.isnull().sum()

Target      0
Age         0
SibSp       0
Parch       0
Fare        0
Sex_F       0
Pclass_1    0
Pclass_2    0
Pclass_3    0
dtype: int64

**Amostragem**

In [32]:
x_train, x_test, y_train, y_test = train_test_split(dados.drop(['Target'], axis = 1), 
dados["Target"], 
test_size = 0.3, 
random_state = 1234)

[{'treino':x_train.shape},{'teste':x_test.shape}]

[{'treino': (623, 8)}, {'teste': (268, 8)}]